
# Άσκηση Εξάσκησης 02: Έλεγχος βαθμού εξέτασης

while True:
    try:
        grade = int(input("Παρακαλώ εισάγετε τον βαθμό που πήρατε στο test των μαθηματικών: "))
        if 0 <= grade <= 100:
            break
        else:
            print("Ο βαθμός πρέπει να είναι μεταξύ 0 και 100.")
    except ValueError:
        print("Παρακαλώ εισάγετε έναν έγκυρο αριθμό!")

if grade < 50:
    print("Δυστυχώς δεν πέρασες.")
elif 50 <= grade <= 69:
    print("Πέρασες οριακά.")
elif 70 <= grade <= 89:
    print("Πολύ καλά!")
elif 90 <= grade <= 100:
    print("Άριστα! Συγχαρητήρια!")
